# ----------------------------------------------------------------------------------------------------
# モジュールフォルダのパスを追加
# ----------------------------------------------------------------------------------------------------
import os, sys
if sys.path.count('api/module') == 0:
	if os.path.basename(os.getcwd()) == 'HealthMileage':
		sys.path.append('api/module')
	elif os.path.basename(os.getcwd()) == 'api':
		os.chdir('../')
		sys.path.append('api/module')
	else:
		exit()


# ----------------------------------------------------------------------------------------------------
# モジュールimport
# ----------------------------------------------------------------------------------------------------
import datetime
import traceback

from module.Main.MainParam import Param as MAINPARAM


# ----------------------------------------------------------------------------------------------------
# 処理実施表示用処理
# ----------------------------------------------------------------------------------------------------
def DrawProcessNow():
	print('{} : Process Now'.format(datetime.datetime.now().strftime('%Y/%m/%d %H:%M:%S')))


# ----------------------------------------------------------------------------------------------------
# Exceptionの内容を表示
# ----------------------------------------------------------------------------------------------------
def DrawException():
	print(traceback.format_exc())


# ----------------------------------------------------------------------------------------------------
# ackの情報の表示関数
# ----------------------------------------------------------------------------------------------------
def DrawAck(ack):

	msg = ack['Msg']
	msg_split = msg.split('\n')

	print('-'*20)
	print(ack['Subject'])
	print()
	for token in msg_split: print(token)
	print('-'*20)


# ----------------------------------------------------------------------------------------------------
# Exceptionの内容の保存
# ----------------------------------------------------------------------------------------------------
def LoggingException():

	date = '{}\n'.format(datetime.datetime.now().strftime('%Y/%m/%d %H:%M:%S'))
	exc = traceback.format_exc()
	with open(MAINPARAM.LOGFILE_PATH, mode='w') as f:
		f.write(date)
		f.write(exc)
